app/Libs/Fedex/validate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:v7="http://fedex.com/ws/cnty/v7">
    <soapenv:Header/>
    <soapenv:Body>
        <v7:ValidatePostalRequest>
            <v7:WebAuthenticationDetail>
                <v7:UserCredential>
                    <v7:Key>G6YiOe5hQz7IeXKM</v7:Key>
                    <v7:Password>Qlalmx2ZhS67igGPTpx7mS6Hk</v7:Password>
                </v7:UserCredential>
            </v7:WebAuthenticationDetail>
            <v7:ClientDetail>
                <v7:AccountNumber>510087160</v7:AccountNumber>
                <v7:MeterNumber>119064776</v7:MeterNumber>
                <v7:Region>US</v7:Region>
                <v7:Localization>
                    <v7:LanguageCode>EN</v7:LanguageCode>
                    <v7:LocaleCode>US</v7:LocaleCode>
                </v7:Localization>
            </v7:ClientDetail>
            <v7:TransactionDetail>
                <v7:CustomerTransactionId>ValidatePostalRequest_Basic</v7:CustomerTransactionId>
                <v7:Localization>
                    <v7:LanguageCode>EN</v7:LanguageCode>
                    <v7:LocaleCode>US</v7:LocaleCode>
                </v7:Localization>
            </v7:TransactionDetail>
            <v7:Version>
                <v7:ServiceId>cnty</v7:ServiceId>
                <v7:Major>7</v7:Major>
                <v7:Intermediate>0</v7:Intermediate>
                <v7:Minor>0</v7:Minor>
            </v7:Version>
            <v7:ShipDateTime>2021-12-12T12:34:56-06:00</v7:ShipDateTime>
            <v7:Address>
                <v7:StreetLines>StreetLine_101</v7:StreetLines>
                <v7:City>Zarqa</v7:City>
                <v7:StateOrProvinceCode>TN</v7:StateOrProvinceCode>
                <v7:PostalCode></v7:PostalCode>
                <v7:CountryCode>JO</v7:CountryCode>
                <v7:Residential>1</v7:Residential>
                <v7:GeographicCoordinates></v7:GeographicCoordinates>
            </v7:Address>
            <v7:RoutingCode>FDSD</v7:RoutingCode>
            <v7:CheckForMismatch>1</v7:CheckForMismatch>
            <v7:CarrierCode>FDXE</v7:CarrierCode>
        </v7:ValidatePostalRequest>
    </soapenv:Body>
</soapenv:Envelope>